# /*
#  * @Author: gaoyuan 
#  * @Date: 2020-07-03 07:52:43 
#  * @Last Modified by:   gaoyuan 
#  * @Last Modified time: 2020-07-03 07:52:43 
 */

import pymysql
import random
courses = ["计算机基础", "大学英语1A", "大学英语1B", "中国近现代史纲要", "高等数学(工)"
           "体育1", "大学英语2A", "大学英语2B", "思想道德修养与法律基础", "大学物理A1",
           "体育2", "程序设计基础(C)", "大学英语3A", "大学英语3B", "毛泽东思想1", "大学物理A2",
           "大学物理实验", "体育3", "大学英语4A", "大学英语4B", "毛泽东思想2",
           "体育4", "计算机网络", "企业管理", "大学英语5", "马克思主义",
           "形势与政策", "专业前沿知识", "", "大学生就业指导", "现代市场营销",
           "儒家经典与智慧", "心理案例分析", "现代科技概论与知识产权", "艺术概论", "", "无机化学B", "无机化学实验B"
           "化工工程制图", "有机化学B", "有机化学实验B", "分析化学B", "生物化学", "生物化学实验", "食品工程原理",
           "食品化学", "微生物学实验", "微生物学", "食品分析与实验", "食品安全与品质控制", "食品营养学"
           "信息与通信工程", "电子科学与技术", "计算机科学与技术", "物联网导论", "电路分析基础", "信号与系统",
           "模拟电子技术", "数字电路与逻辑设计", "微机原理与接口技术", "工程电磁场", "通信原理", "计算机网络",
           "现代通信网", "传感器原理", "嵌入式系统设计", "无线通信原理", "无线传感器网络", "近距无线传输技术",
           "二维条码技术", "数据采集与处理", "物联网安全技术", "物联网组网技术"
           "电路", "信号与系统", "PLC编程应用", "模拟电子技术", "数字电子技术", "自动控制原理", "现代控制理论",
           "微机原理及应用", "软件技术基础", "电机与拖动", "电力电子技术", "计算机控制技术", "系统仿真", "计算机网络",
           "运动控制", "过程控制", "单片机与嵌入式系统原理", "计算机辅助设计", "专业英语", "智能控制", "C语言程序设计", "C++语言"]

con = pymysql.connect(host='localhost', user='root',
                      port=3306, password='496532343', db="curriculum")
cursor = con.cursor()

for i in range(len(courses) - 1):
    no = str(i + 1)
    j = random.randint(1, 5)
    credits = random.randint(1, 10)
    insert = ""
    insert = "insert into c(Cno,Cname,Ccredit) values('%s','%s','%d')" % (
        no, courses[i], credits)
    cursor.execute(insert)

con.commit()
cursor.close()
con.close()
